--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  Analysis
       log:  C:\Users\u0091183\Desktop\Phd\Papers\startup joiners\joiners\joiners_analysis.log
  log type:  text
 opened on:  15 Nov 2016, 17:22:35

. 
. use joinersc.dta

. set matsize 10000

. /*++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
>                                                                 IMPORTANT VARIABLES
> 
> age             age2            male            mar             race            degree          major     hdclas
> tenure  newbus          emsize          emtp    emrg            emsecdt         facadv    facben
> facchal facind          facloc          facresp facsal          facsoc          fptind    industry        
> bindustry       lfstat  nocpr           nocprmg nocprng         waprsm          wascsm    wapri
> wasec   workexp         waacc           waemrl  wamgmt          waprod          waqm      wasale
> wasvc   waaprsh         wabrsh          wacom   wadev           wadsn           waot      watea
> wan             cmrcn           resn            emplr   wage03          wage06          wage08    wage10
> lnwage03        lnwage06        lnwage08        lnwage10                dlnwage
> 
> +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++*/
. 
. // summary statistics for full dataset 
. logout, save(summary_full) word fix replace: fsum ibn.emplr wage03 wage06 wage08 wage10 lnwage03 lnwage06 lnwage08 lnwage10 dlnwage age age2 male mar ibn.race ibn.degree ibn.major ibn.hdclas t
> enure newbus ibn.emsize ibn.emrg ibn.emsecdt ibn.facadv ibn.facben ibn.facchal ibn.facind ibn.facloc ibn.facres ibn.facsal ibn.facsoc ibn.fptind ibn.bindustry  ibn.lfstat ibn.nocprng workexp i
> bn.wapri waacc waemrl wamgmt waprod     waqm wasale wasvc waaprsh wabrsh wacom  wadev wadsn waot watea wan cmrcn resn if emplr != ., uselabel fvwrap(4) 
factor variables and time-series operators not allowed
r(101);

end of do-file

r(101);

. do "C:\Users\u0091183\AppData\Local\Temp\STD01000000.tmp"

. fsum wage03, catvar(emplr) uselabel fvwrap(4)
option fvwrap() not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\u0091183\AppData\Local\Temp\STD01000000.tmp"

. 
. fsum wage03, catvar(emplr) uselabel f(%9.1f)

             Variable |        N     Mean       SD      Min      Max                                                                                                                              
----------------------+---------------------------------------------
 H_JOB_SALARY_ANN_PUB |    83024  64162.5  36370.0      0.0 150000.0  

. 
end of do-file

. do "C:\Users\u0091183\AppData\Local\Temp\STD01000000.tmp"

. fsum wage03 emplr, catvar(emplr) uselabel f(%9.1f)

               Variable |        N     Mean       SD      Min      Max                                                                                                                              
------------------------+---------------------------------------------
   H_JOB_SALARY_ANN_PUB |    83024  64162.5  36370.0      0.0 150000.0  
          Employer Type |    68258      2.8      0.5      1.0      3.0  
           Startup (%)  |     1741      2.6
 Small Established (%)  |    11187     16.4
 Large Established (%)  |    55330     81.1

. 
end of do-file

. do "C:\Users\u0091183\AppData\Local\Temp\STD01000000.tmp"

. fsum wage03 emplr degree, catvar(emplr degree) uselabel f(%9.1f)

               Variable |        N     Mean       SD      Min      Max                                                                                                                              
------------------------+---------------------------------------------
   H_JOB_SALARY_ANN_PUB |    83024  64162.5  36370.0      0.0 150000.0  
          Employer Type |    68258      2.8      0.5      1.0      3.0  
           Startup (%)  |     1741      2.6
 Small Established (%)  |    11187     16.4
 Large Established (%)  |    55330     81.1
         Highest degree |   100402      1.7      0.9      1.0      4.0  
        Bachelor's (%)  |    53796     53.6
          Master's (%)  |    30839     30.7
         Doctorate (%)  |     8860      8.8
      Professional (%)  |     6907      6.9

. 
end of do-file

