--------------------------------------------------------------------------------------------------
      name:  Analysis
       log:  C:\Users\u0091183\Desktop\Phd\Papers\startup joiners\joiners\joiners_analysis.log
  log type:  text
 opened on:  11 Nov 2016, 19:09:09

.                                                         
. use "C:\Users\u0091183\Desktop\Phd\Datasets\SESTAT\2003\nscg2003.dta"

. 
. rename salary wage03

. 
. merge 1:1 refid using sestat06.dta, keepus(wage06)

    Result                           # of obs.
    -----------------------------------------
    not matched                       104,154
        from master                    49,746  (_merge==1)
        from using                     54,408  (_merge==2)

    matched                            50,656  (_merge==3)
    -----------------------------------------

. drop if refyr == .
(54,408 observations deleted)

. drop _merge

. merge 1:1 refid using sestat08.dta, keepus(wage08)

    Result                           # of obs.
    -----------------------------------------
    not matched                       111,017
        from master                    55,553  (_merge==1)
        from using                     55,464  (_merge==2)

    matched                            44,849  (_merge==3)
    -----------------------------------------

. drop if refyr == .
(55,464 observations deleted)

. drop _merge

. merge 1:1 refid using sestat10.dta, keepus(wage10)

    Result                           # of obs.
    -----------------------------------------
    not matched                       165,005
        from master                    78,535  (_merge==1)
        from using                     86,470  (_merge==2)

    matched                            21,867  (_merge==3)
    -----------------------------------------

. drop if refyr == .
(86,470 observations deleted)

. drop _merge

. 
. // put incorrect wages to missing
. 
. foreach i in wage03 wage06 wage08 wage10 {
  2.         replace `i' = . if `i' >= 999998
  3. }
(17,378 real changes made, 17,378 to missing)
(7,802 real changes made, 7,802 to missing)
(7,937 real changes made, 7,937 to missing)
(4,607 real changes made, 4,607 to missing)

. 
. 
. 
end of do-file

. tab wage06

H_JOB_SALAR |
  Y_ANN_PUB |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        177        0.41        0.41
       1000 |        117        0.27        0.69
       2000 |        121        0.28        0.97
       3000 |         97        0.23        1.19
       4000 |        120        0.28        1.47
       5000 |        168        0.39        1.87
       6000 |        154        0.36        2.23
       7000 |         82        0.19        2.42
       8000 |        102        0.24        2.66
       9000 |         70        0.16        2.82
      10000 |        271        0.63        3.45
      11000 |         63        0.15        3.60
      12000 |        235        0.55        4.15
      13000 |         69        0.16        4.31
      14000 |         83        0.19        4.50
      15000 |        206        0.48        4.98
      16000 |         95        0.22        5.20
      17000 |         80        0.19        5.39
      18000 |        149        0.35        5.74
      19000 |         64        0.15        5.89
      20000 |        353        0.82        6.71
      21000 |         76        0.18        6.89
      22000 |        118        0.28        7.16
      23000 |        108        0.25        7.42
      24000 |        197        0.46        7.88
      25000 |        297        0.69        8.57
      26000 |        129        0.30        8.87
      27000 |        130        0.30        9.17
      28000 |        145        0.34        9.51
      29000 |         96        0.22        9.74
      30000 |        617        1.44       11.18
      31000 |        136        0.32       11.49
      32000 |        242        0.56       12.06
      33000 |        153        0.36       12.41
      34000 |        174        0.41       12.82
      35000 |        463        1.08       13.90
      36000 |        285        0.67       14.57
      37000 |        206        0.48       15.05
      38000 |        308        0.72       15.77
      39000 |        184        0.43       16.19
      40000 |        862        2.01       18.21
      41000 |        198        0.46       18.67
      42000 |        397        0.93       19.59
      43000 |        276        0.64       20.24
      44000 |        210        0.49       20.73
      45000 |        645        1.51       22.23
      46000 |        252        0.59       22.82
      47000 |        199        0.46       23.29
      48000 |        444        1.04       24.32
      49000 |        225        0.53       24.85
      50000 |      1,313        3.06       27.91
      51000 |        194        0.45       28.36
      52000 |        486        1.13       29.50
      53000 |        307        0.72       30.21
      54000 |        287        0.67       30.88
      55000 |        550        1.28       32.17
      56000 |        311        0.73       32.89
      57000 |        183        0.43       33.32
      58000 |        333        0.78       34.10
      59000 |        209        0.49       34.58
      60000 |      1,464        3.42       38.00
      61000 |        194        0.45       38.45
      62000 |        387        0.90       39.36
      63000 |        320        0.75       40.10
      64000 |        265        0.62       40.72
      65000 |        850        1.98       42.71
      66000 |        234        0.55       43.25
      67000 |        260        0.61       43.86
      68000 |        377        0.88       44.74
      69000 |        223        0.52       45.26
      70000 |      1,226        2.86       48.12
      71000 |        218        0.51       48.63
      72000 |        553        1.29       49.92
      73000 |        283        0.66       50.58
      74000 |        218        0.51       51.09
      75000 |      1,052        2.45       53.54
      76000 |        232        0.54       54.08
      77000 |        238        0.56       54.64
      78000 |        395        0.92       55.56
      79000 |        188        0.44       56.00
      80000 |      1,263        2.95       58.95
      81000 |        177        0.41       59.36
      82000 |        342        0.80       60.16
      83000 |        249        0.58       60.74
      84000 |        302        0.70       61.44
      85000 |        789        1.84       63.28
      86000 |        266        0.62       63.91
      87000 |        214        0.50       64.40
      88000 |        283        0.66       65.07
      89000 |        240        0.56       65.63
      90000 |      1,084        2.53       68.15
      91000 |        139        0.32       68.48
      92000 |        296        0.69       69.17
      93000 |        266        0.62       69.79
      94000 |        219        0.51       70.30
      95000 |        525        1.23       71.53
      96000 |        281        0.66       72.18
      97000 |        184        0.43       72.61
      98000 |        316        0.74       73.35
      99000 |        139        0.32       73.67
     100000 |      1,532        3.57       77.25
     101000 |        145        0.34       77.59
     102000 |        221        0.52       78.10
     103000 |        198        0.46       78.56
     104000 |        190        0.44       79.01
     105000 |        398        0.93       79.94
     106000 |        143        0.33       80.27
     107000 |        114        0.27       80.54
     108000 |        167        0.39       80.93
     109000 |        113        0.26       81.19
     110000 |        646        1.51       82.70
     111000 |         44        0.10       82.80
     112000 |         98        0.23       83.03
     113000 |         89        0.21       83.24
     114000 |         89        0.21       83.44
     115000 |        272        0.63       84.08
     116000 |         74        0.17       84.25
     117000 |         74        0.17       84.42
     118000 |         99        0.23       84.65
     119000 |         41        0.10       84.75
     120000 |        829        1.93       86.69
     121000 |         39        0.09       86.78
     122000 |         63        0.15       86.92
     123000 |         46        0.11       87.03
     124000 |         50        0.12       87.15
     125000 |        352        0.82       87.97
     126000 |         54        0.13       88.09
     127000 |         50        0.12       88.21
     128000 |         70        0.16       88.37
     129000 |         33        0.08       88.45
     130000 |        413        0.96       89.42
     131000 |         25        0.06       89.47
     132000 |         57        0.13       89.61
     133000 |         36        0.08       89.69
     134000 |         43        0.10       89.79
     135000 |        167        0.39       90.18
     136000 |         32        0.07       90.26
     137000 |         25        0.06       90.31
     138000 |         52        0.12       90.43
     139000 |         21        0.05       90.48
     140000 |        337        0.79       91.27
     141000 |         19        0.04       91.31
     142000 |         27        0.06       91.38
     143000 |         31        0.07       91.45
     144000 |         39        0.09       91.54
     145000 |         98        0.23       91.77
     146000 |         31        0.07       91.84
     147000 |         20        0.05       91.89
     148000 |         27        0.06       91.95
     149000 |         13        0.03       91.98
     150000 |      3,436        8.02      100.00
------------+-----------------------------------
      Total |     42,854      100.00

. exit, clear
