--------------------------------------------------------------------------------------------------
      name:  SESTAT_2003_2013_Joiners_setup
       log:  C:\Users\u0091183\Desktop\Phd\Papers\startup joiners\joiners\joiners_setup.log
  log type:  text
 opened on:  11 Nov 2016, 20:28:55

. 
. use "C:\Users\u0091183\Desktop\Phd\Datasets\SESTAT\sestat06.dta"

. rename salarp wage06

. save sestat06, replace
(note: file sestat06.dta not found)
file sestat06.dta saved

. 
. use "C:\Users\u0091183\Desktop\Phd\Datasets\SESTAT\sestat08.dta"

. rename salarp wage08

. save sestat08, replace
(note: file sestat08.dta not found)
file sestat08.dta saved

. 
. use "C:\Users\u0091183\Desktop\Phd\Datasets\SESTAT\sestat10.dta"

. rename salarp wage10

. save sestat10, replace
(note: file sestat10.dta not found)
file sestat10.dta saved

. 
. clear all 

. 
. use "C:\Users\u0091183\Desktop\Phd\Datasets\SESTAT\2003\nscg2003.dta"

. 
. rename salary wage03

. 
. merge 1:1 refid using sestat06.dta, keepus(wage06)

    Result                           # of obs.
    -----------------------------------------
    not matched                       104,154
        from master                    49,746  (_merge==1)
        from using                     54,408  (_merge==2)

    matched                            50,656  (_merge==3)
    -----------------------------------------

. drop if refyr == .
(54,408 observations deleted)

. drop _merge

. merge 1:1 refid using sestat08.dta, keepus(wage08)

    Result                           # of obs.
    -----------------------------------------
    not matched                       111,017
        from master                    55,553  (_merge==1)
        from using                     55,464  (_merge==2)

    matched                            44,849  (_merge==3)
    -----------------------------------------

. drop if refyr == .
(55,464 observations deleted)

. drop _merge

. merge 1:1 refid using sestat10.dta, keepus(wage10)

    Result                           # of obs.
    -----------------------------------------
    not matched                       165,005
        from master                    78,535  (_merge==1)
        from using                     86,470  (_merge==2)

    matched                            21,867  (_merge==3)
    -----------------------------------------

. drop if refyr == .
(86,470 observations deleted)

. drop _merge

. 
. save joiners.dta, replace
(note: file joiners.dta not found)
file joiners.dta saved

. 
. 
. 
. 
. 
end of do-file

. exit, clear
